-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Авг 14 2022 г., 22:08
-- Версия сервера: 10.4.24-MariaDB
-- Версия PHP: 8.1.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `xml_app`
--

-- --------------------------------------------------------

--
-- Структура таблицы `xml_data`
--

CREATE TABLE `xml_data` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `mark` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `model` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `generation` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `year` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `run` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `color` varchar(30) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `body-type` varchar(30) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `engine-type` varchar(30) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `transmission` varchar(30) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `gear-type` varchar(30) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `generation_id` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `xml_data`
--

INSERT INTO `xml_data` (`id`, `mark`, `model`, `generation`, `year`, `run`, `color`, `body-type`, `engine-type`, `transmission`, `gear-type`, `generation_id`) VALUES
(359039, 'ГАЗ', '13 «Чайка»', '(1959-1981)', '1968', '1453', 'Белый', 'Седан', 'Бензин', 'Автоматическая', 'Задний', '20351648'),
(402501, 'Волжанин', '5285', '(1959-1980)', '2012', '192500', 'Зеленый', 'Специальный', 'Дизель', 'Механическая', 'Задний', '2342141'),
(412873, 'Honda', 'CR-V', 'V (2016-2022)', '2017', '47751', 'Серебристый', 'Внедорожник 5 дв.', 'Бензин', 'Вариатор', 'Полный', '20875803'),
(415531, 'Kia', 'Cerato', 'IV (2018-2021)', '2020', '43009', 'Черный', 'Седан', 'Бензин', 'Автоматическая', 'Передний', '21383450'),
(418415, 'Porsche', 'Boxster', 'III (981) (2012-2016)', '2013', '16102', 'Коричневый', 'Родстер', 'Бензин', 'Робот', 'Задний', '8283150'),
(419842, 'Mercedes', 'GLA', 'I (X156) (2013-2017)', '2014', '94500', 'Красный', 'Внедорожник 5 дв.', 'Бензин', 'Робот', 'Передний', '20090323'),
(420703, 'Audi', 'A6', 'IV (C7) Рестайлинг (2014-2018)', '2016', '144000', 'Черный', 'Седан', 'Бензин', 'Робот', 'Полный', '20246005'),
(421394, 'Kia', 'Seltos', 'I (2019-2022)', '2021', '14114', 'Синий', 'Внедорожник 5 дв.', 'Бензин', 'Механическая', 'Полный', '21662520'),
(422031, 'Volkswagen', 'Jetta', 'I (1978-1984)', '1981', '233111', 'Зеленый', 'Седан', 'Бензин', 'Механическая', 'Передний', '3493006'),
(423659, 'Hyundai', 'Solaris', 'II Рестайлинг (2020-2022)', '2021', '29880', 'Черный', 'Седан', 'Бензин', 'Механическая', 'Передний', '21796089'),
(424231, 'Land Rover', 'Defender', 'II (2019-2022)', '2020', '9282', 'Зеленый', 'Внедорожник 5 дв.', 'Дизель', 'Автоматическая', 'Полный', '21667063'),
(424680, 'Renault', 'Kadjar', 'I (2015-2018)', '2017', '88973', 'Синий', 'Внедорожник 5 дв.', 'Дизель', 'Робот', 'Передний', '20554957'),
(425314, 'Audi', 'A6', 'IV (C7) (2011-2014)', '2012', '179168', 'Белый', 'Седан', 'Дизель', 'Робот', 'Полный', '6937659'),
(425517, 'Infiniti', 'QX50', 'I (2013-2015)', '2013', '147380', 'Бордовый', 'Внедорожник 5 дв.', 'Бензин', 'Автоматическая', 'Полный', '20182055'),
(425617, 'Volkswagen', 'Golf R', 'VII (2013-2017)', '2014', '164685', 'Синий', 'Хэтчбек 3 дв.', 'Бензин', 'Механическая', 'Полный', '20063351'),
(426760, 'Skoda', 'Superb', 'III (2015-2019)', '2016', '65606', 'Белый', 'Лифтбек', 'Бензин', 'Робот', 'Передний', '20483375'),
(427266, 'Audi', 'A3', 'III (8V) Рестайлинг (2016-2020)', '2019', '34279', 'Темно-синий', 'Седан', 'Бензин', 'Робот', 'Передний', '20785010'),
(427287, 'Nissan', 'Murano', 'II (Z51) Рестайлинг 2 (2011-2015)', '2014', '127426', 'Белый', 'Внедорожник 5 дв.', 'Бензин', 'Вариатор', 'Полный', '20288827'),
(428132, 'Nissan', 'Qashqai', 'II Рестайлинг (2017-2022)', '2019', '85197', 'Белый', 'Внедорожник 5 дв.', 'Бензин', 'Вариатор', 'Полный', '21060966'),
(428491, 'Ford', 'EcoSport', 'I (2014-2018)', '2015', '24737', 'Оранжевый', 'Внедорожник 5 дв.', 'Бензин', 'Робот', 'Передний', '20104320'),
(428603, 'BMW', '5 серии', 'VI (F10/F11/F07) (2009-2013)', '2011', '236979', 'Белый', 'Седан', 'Бензин', 'Автоматическая', 'Задний', '6088519'),
(429224, 'Kia', 'Sportage', 'IV (2016-2018)', '2017', '101939', 'Черный', 'Внедорожник 5 дв.', 'Дизель', 'Автоматическая', 'Полный', '20683534'),
(429351, 'Volkswagen', 'Tiguan', 'I Рестайлинг (2011-2017)', '2013', '86650', 'Серый', 'Внедорожник 5 дв.', 'Бензин', 'Механическая', 'Передний', '7339785'),
(429444, 'Nissan', 'Teana', 'II Рестайлинг (2011-2014)', '2012', '115482', 'Бордовый', 'Седан', 'Бензин', 'Вариатор', 'Передний', '20194453'),
(429899, 'Renault', 'Talisman', 'I (2015-2020)', '2017', '83700', 'Синий', 'Универсал 5 дв.', 'Дизель', 'Механическая', 'Передний', '20643098'),
(429975, 'Jaguar', 'XKR', 'I (1998-2004)', '1999', '65746', 'Красный', 'Кабриолет', 'Бензин', 'Автоматическая', 'Задний', '8260361'),
(430069, 'Skoda', 'Rapid', 'I Рестайлинг (2017-2020)', '2020', '16761', 'Коричневый', 'Лифтбек', 'Бензин', 'Механическая', 'Передний', '21005574'),
(430231, 'Mercedes', 'GLK-Класс', 'I (X204) Рестайлинг (2012-2015)', '2014', '204434', 'Черный', 'Внедорожник 5 дв.', 'Дизель', 'Автоматическая', 'Полный', '8225450'),
(430913, 'Volkswagen', 'Polo', 'VI (2020-2022)', '2021', '1', 'Белый', 'Лифтбек', 'Бензин', 'Автоматическая', 'Передний', '22163516'),
(431106, 'Kia', 'Optima', 'IV Рестайлинг (2018-2020)', '2018', '82217', 'Синий', 'Седан', 'Бензин', 'Автоматическая', 'Передний', '21342050'),
(431188, 'Mercedes', 'Viano', 'I (W639) (2003-2010)', '2008', '172069', 'Черный', 'Минивэн Long', 'Бензин', 'Автоматическая', 'Задний', '2307843'),
(431468, 'Toyota', 'Camry', 'VII (XV50) (2011-2014)', '2013', '127103', 'Черный', 'Седан', 'Бензин', 'Автоматическая', 'Передний', '7722388'),
(431552, 'Skoda', 'Rapid', 'I (2012-2017)', '2016', '114996', 'Синий', 'Лифтбек', 'Бензин', 'Механическая', 'Передний', '9275797'),
(431615, 'Kia', 'Sorento', 'III Prime Рестайлинг (2017-2020)', '2019', '49186', 'Белый', 'Внедорожник 5 дв.', 'Бензин', 'Автоматическая', 'Полный', '21180462'),
(432237, 'Nissan', 'Qashqai', 'II Рестайлинг (2017-2022)', '2021', '15181', 'Темно-серый', 'Внедорожник 5 дв.', 'Бензин', 'Вариатор', 'Передний', '21060966'),
(432302, 'Hyundai', 'i40', 'I (2011-2015)', '2012', '135254', 'Красный', 'Седан', 'Бензин', 'Автоматическая', 'Передний', '7909720'),
(432370, 'Skoda', 'Kodiaq', 'I (2016-2022)', '2018', '68481', 'Белый', 'Внедорожник 5 дв.', 'Бензин', 'Робот', 'Полный', '20839003'),
(432457, 'Mercedes', 'C-Класс', 'IV (W205) (2014-2018)', '2015', '147641', 'Белый', 'Седан', 'Бензин', 'Автоматическая', 'Задний', '20089956'),
(434020, 'BMW', 'X2', 'I (F39) (2017-2022)', '2019', '2227', 'Белый', 'Внедорожник 5 дв.', 'Бензин', 'Робот', 'Передний', '20847120'),
(434040, 'Mercedes', 'E-Класс', 'V (W213, S213, C238) (2016-2021)', '2016', '128618', 'Array', 'Седан', 'Бензин', 'Автоматическая', 'Полный', '20743500'),
(434126, 'Renault', 'Kadjar', 'I (2015-2018)', '2017', '105245', 'Черный', 'Внедорожник 5 дв.', 'Дизель', 'Робот', 'Передний', '20554957'),
(434765, 'Skoda', 'Octavia', 'III (A7) (2013-2017)', '2017', '97935', 'Серебристый', 'Лифтбек', 'Бензин', 'Робот', 'Передний', '9338208'),
(434825, 'Nissan', 'Juke', 'I (2010-2014)', '2012', '182132', 'Серый', 'Внедорожник 5 дв.', 'Бензин', 'Механическая', 'Передний', '7277649'),
(435609, 'Hyundai', 'Tucson', 'IV (2020-2022)', '2021', '800', 'Черный', 'Внедорожник 5 дв.', 'Бензин', 'Автоматическая', 'Полный', '22514490'),
(435652, 'Volkswagen', 'Polo', 'VI (2020-2022)', '2021', '11936', 'Черный', 'Лифтбек', 'Бензин', 'Робот', 'Передний', '22163516'),
(435823, 'Porsche', 'Taycan', 'I (2019-2022)', '2021', '12', 'Белый', 'Седан', 'Электромотор', 'Автоматическая', 'Полный', '21659436'),
(435901, 'Nissan', 'Murano', 'III (Z52) (2014-2022)', '2017', '23598', 'Черный', 'Внедорожник 5 дв.', 'Бензин', 'Вариатор', 'Полный', '20511583'),
(436370, 'Kia', 'Cerato', 'IV (2018-2021)', '2019', '17602', 'Белый', 'Седан', 'Бензин', 'Автоматическая', 'Передний', '21383450'),
(436467, 'BMW', '5 серии', 'VI (F10/F11/F07) Рестайлинг (2013-2017)', '2014', '148937', 'Черный', 'Седан', 'Дизель', 'Автоматическая', 'Задний', '10436648'),
(436899, 'Hyundai', 'Tucson', 'III Рестайлинг (2018-2021)', '2020', '25748', 'Синий', 'Внедорожник 5 дв.', 'Бензин', 'Автоматическая', 'Полный', '21343951'),
(437188, 'Toyota', 'Highlander', 'III (U50) (2013-2016)', '2015', '117819', 'Черный', 'Внедорожник 5 дв.', 'Бензин', 'Автоматическая', 'Полный', '20082320'),
(437366, 'Volkswagen', 'Golf', 'VII (2012-2017)', '2013', '140262', 'Красный', 'Хэтчбек 5 дв.', 'Бензин', 'Робот', 'Передний', '9290793'),
(437960, 'Peugeot', '408', 'I (2012-2017)', '2015', '140336', 'Черный', 'Седан', 'Бензин', 'Автоматическая', 'Передний', '8350849'),
(438137, 'Skoda', 'Yeti', 'I Рестайлинг (2013-2018)', '2014', '34363', 'Белый', 'Внедорожник 5 дв.', 'Бензин', 'Робот', 'Передний', '20078038'),
(438202, 'Mitsubishi', 'Pajero Sport', 'III (2015-2021)', '2018', '92255', 'Серый', 'Внедорожник 5 дв.', 'Дизель', 'Автоматическая', 'Полный', '20663923'),
(438265, 'Volvo', 'S60', 'II Рестайлинг (2013-2018)', '2014', '117012', 'Бежевый', 'Седан', 'Бензин', 'Робот', 'Передний', '20008720'),
(438277, 'Honda', 'Civic', 'IX (2011-2015)', '2012', '185066', 'Белый', 'Хэтчбек 5 дв.', 'Бензин', 'Автоматическая', 'Передний', '7879824'),
(438778, 'Ford', 'Focus', 'II Рестайлинг (2007-2011)', '2008', '69342', 'Серебристый', 'Универсал 5 дв.', 'Бензин', 'Механическая', 'Передний', '2306579'),
(438793, 'Hyundai', 'Creta', 'I (2016-2020)', '2018', '137276', 'Белый', 'Внедорожник 5 дв.', 'Бензин', 'Механическая', 'Передний', '20773960'),
(438808, 'Ford', 'Transit', 'Array', '2016', '174179', 'Белый', 'Цельнометаллический фургон', 'Дизель', 'Механическая', 'Передний', 'Array'),
(438818, 'Porsche', 'Panamera', 'II Рестайлинг (2020-2022)', '2021', '18', 'Серый', 'Хэтчбек 5 дв.', 'Бензин', 'Робот', 'Полный', '22481288'),
(439216, 'Skoda', 'Yeti', 'I Рестайлинг (2013-2018)', '2014', '84550', 'Серебристый', 'Внедорожник 5 дв.', 'Бензин', 'Робот', 'Передний', '20078038'),
(439416, 'Kia', 'Sorento', 'II Рестайлинг (2012-2021)', '2012', '149023', 'Бежевый', 'Внедорожник 5 дв.', 'Бензин', 'Автоматическая', 'Передний', '8506299'),
(439596, 'LADA (ВАЗ)', 'Vesta', 'I (2015-2022)', '2019', '20440', 'Коричневый', 'Седан', 'Бензин', 'Механическая', 'Передний', '20417749'),
(439622, 'Hyundai', 'Tucson', 'IV (2020-2022)', '2021', '34', 'Белый', 'Внедорожник 5 дв.', 'Бензин', 'Автоматическая', 'Полный', '22514490'),
(439624, 'Nissan', 'X-Trail', 'III Рестайлинг (2017-2022)', '2021', '10', 'Белый', 'Внедорожник 5 дв.', 'Бензин', 'Вариатор', 'Передний', '21179303'),
(439730, 'BMW', 'i3', 'I (I01) (2013-2017)', '2017', '72500', 'Черный', 'Хэтчбек 5 дв.', 'Бензин гибридный', 'Автоматическая', 'Задний', '20342220'),
(439731, 'Nissan', 'X-Trail', 'III (2013-2019)', '2016', '76116', 'Черный', 'Внедорожник 5 дв.', 'Бензин', 'Вариатор', 'Полный', '20246517'),
(439782, 'Hyundai', 'Solaris', 'II (2017-2020)', '2018', '105816', 'Белый', 'Седан', 'Бензин', 'Автоматическая', 'Передний', '20922677'),
(439802, 'Ford', 'Mondeo', 'IV Рестайлинг (2010-2014)', '2011', '71450', 'Черный', 'Седан', 'Бензин', 'Автоматическая', 'Передний', '6519702'),
(440048, 'Audi', 'A6', 'IV (C7) Рестайлинг (2014-2018)', '2015', '163108', 'Черный', 'Седан', 'Бензин', 'Робот', 'Полный', '20246005'),
(440360, 'Skoda', 'Octavia', 'III (A7) Рестайлинг (2017-2020)', '2017', '32613', 'Белый', 'Лифтбек', 'Бензин', 'Робот', 'Передний', '20898195'),
(440379, 'Volvo', 'XC40', 'I (2017-2022)', '2020', '42027', 'Красный', 'Внедорожник 5 дв.', 'Бензин', 'Автоматическая', 'Полный', '21105292'),
(440418, 'Mercedes', 'G-Класс', 'II (W463) (1990-2006)', '2005', '127632', 'Серебристый', 'Внедорожник 5 дв.', 'Бензин', 'Автоматическая', 'Полный', '4760268');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `xml_data`
--
ALTER TABLE `xml_data`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `xml_data`
--
ALTER TABLE `xml_data`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=440419;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
